Revit 2024 API
BuiltInFailures.SlabShapeFailures.SlabShapeWarnVerticesDeleted Property
 Some slab shape edit vertices were deleted because the Floor or Roof or Toposolid has changed its shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SlabShapeWarnVerticesDeleted { get; }
Visual Basic
Public Shared ReadOnly Property SlabShapeWarnVerticesDeleted As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SlabShapeWarnVerticesDeleted {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace